/*
 *   Copyright (c) 2024 妙码学院 @Heyi
 *   All rights reserved.
 *   妙码学院官方出品，作者 @Heyi，供学员学习使用，可用作练习，可用作美化简历，不可开源。
 */
export function Text() {
    return (
        <svg xmlns="http://www.w3.org/2000/svg" id="icon-import" viewBox="0 0 24 24" fill="var(--fg-color)" stroke="none">
            <path d="M1.67615 9.51384H5.49753V20H7.71912V9.51384H11.5405V7.63635H1.67615V9.51384Z" fill="var(--bg-color)" />
            <path
                d="M18.6559 10.7273H16.8267V8.50567H14.6413V10.7273H13.3253V12.4176H14.6413V17.5731C14.6292 19.3178 15.897 20.1751 17.539 20.1268C18.1608 20.1087 18.5895 19.9879 18.8249 19.9094L18.4566 18.201C18.3359 18.2312 18.0884 18.2855 17.8167 18.2855C17.2674 18.2855 16.8267 18.0923 16.8267 17.2109V12.4176H18.6559V10.7273Z"
                fill="var(--bg-color)"
            />
        </svg>
    )
}
